/**
 *
 *	@file		key.hpp
 *
 *	@brief		キー入力処理
 *
 *	@author		株式会社エムスクエア・ラボ　山形
 *
 *	@date		create : 2024/01/16
 *
 */
#ifndef  __KEY_HPP__
#define __KEY_HPP__
#include "timer.hpp"
/*==========================================================================================
	定数定義
==========================================================================================*/


/*==========================================================================================
	変数定義
==========================================================================================*/
/**
 * @struct	
 * @brief	
 */
/**
 * @class 	KeyInput
 * @brief	キー入力処理
 */
class KeyInput{
	private:
		unsigned long backTime;              //前更新時間
		unsigned long updateTime;               //更新時間
		int keyPin;
		int toggle;
		IntervalTimer *timer;

	public:
		KeyInput(int, unsigned long t = 50);    //インストラクタ
		~KeyInput(void);				//デスインタラクタ
		int isKey(void);      	//キー入力確認
		void setTime(unsigned long);     	//更新時間設定
		void init(void);     	//データ初期化
};
/*==========================================================================================
	関数定義
==========================================================================================*/


#endif